piconomix/px-fwlib/libs/STM32Cube/L1/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="ARMCM33 CMSIS">
      <description>Generic Arm Cortex-M33 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM33*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM33 CMSIS GCC">
      <description>Generic Arm Cortex-M33 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM33 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMSC000 CMSIS">
      <description>Generic Arm SC000 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMSC000"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMSC000 CMSIS GCC">
      <description>Generic Arm SC000 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMSC000 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMSC300 CMSIS">
      <description>Generic Arm SC300 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMSC300"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMSC300 CMSIS GCC">
      <description>Generic Arm SC300 device startup and dependson CMSIS Core requiring GCC</description>
      <require condition="ARMSC300 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMv8MBL CMSIS">
      <description>Generic Armv8-M Baseline device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMv8MBL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMv8MBL CMSIS GCC">
      <description>Generic Armv8-M Baseline device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMv8MBL CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMv8MML CMSIS">
      <description>Generic Armv8-M Mainline device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMv8MML*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMv8MML CMSIS GCC">
      <description>Generic Armv8-M Mainline device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMv8MML CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCA5 CMSIS">
      <description>Generic Arm Cortex-A5 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCA5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCA7 CMSIS">
      <description>Generic Arm Cortex-A7 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCA7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCA9 CMSIS">
      <description>Generic Arm Cortex-A9 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCA9"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- CMSIS DSP -->
    <condition id="CMSIS DSP">
      <description>Components required for DSP</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- CMSIS NN -->
    <condition id="CMSIS NN">
      <description>Components required for NN</description>
      <require condition="CMSIS DSP"/>
    </condition>

    <!-- RTOS RTX -->
    <condition id="RTOS RTX">
      <description>Components required for RTOS RTX</description>
      <require condition="ARMv6_7-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <deny    Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS RTX IFX">
      <description>Components required for RTOS RTX IFX</description>
      <require condition="ARMv6_7-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Dvendor="Infineon:7" Dname="XMC4*"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <deny    Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS RTX5">
      <description>Components required for RTOS RTX5</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS2 RTX5">
      <description>Components required for RTOS2 RTX5</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="RTOS2 RTX5 v7-A">
      <description>Components required for RTOS2 RTX5 on Armv7-A</description>
      <require condition="ARMv7-A Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="OS Tick"/>
      <require Cclass="Device" Cgroup="IRQ Controller"/>
    </condition>
    <condition id="RTOS2 RTX5 Lib">
      <description>Components required for RTOS2 RTX5 Library</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="RTOS2 RTX5 NS">
      <description>Components required for RTOS2 RTX5 in Non-Secure Domain</description>
      <require condition="ARMv8-M TZ Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>

    <!-- OS Tick -->
    <condition id="OS Tick PTIM">
      <description>Components required for OS Tick Private Timer</description>
      <require condition="CA5_CA9"/>
      <require Cclass="Device" Cgroup="IRQ Controller"/>
    </condition>

    <condition id="OS Tick GTIM">
      <description>Components required for OS Tick Generic Physical Timer</description>
      <require condition="CA7"/>
      <require Cclass="Device" Cgroup="IRQ Controller"/>
    </condition>

